{
	"class_name": "Model",
	"config": {
		"name": "keras_model4",
		"layers": [
			{
				"name": "input_1",
				"class_name": "InputLayer",
				"config": {
					"batch_input_shape": [null, 784],
					"dtype": "float32",
					"sparse": false,
					"name": "input_1"
				},
				"inbound_nodes": [
					[]
				]
			},
			{
				"class_name": "Dense",
				"config": {
					"name": "dense_1",
					"trainable": true,
					"units": 512,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "uniform",
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					}
				},
				"name": "dense_1",
				"inbound_nodes": [
					[
						[
							"input_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"config": {
					"name": "dropout_1",
					"trainable": true,
					"rate": 0.2
				},
				"class_name": "Dropout",
				"name": "dropout_1",
				"inbound_nodes": [
					[
						[
							"dense_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Dense",
				"config": {
					"name": "dense_2",
					"trainable": true,
					"units": 512,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "uniform",
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					}
				},
				"name": "dense_2",
				"inbound_nodes": [
					[
						[
							"dropout_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"config": {
					"name": "dropout_2",
					"trainable": true,
					"rate": 0.2
				},
				"class_name": "Dropout",
				"name": "dropout_2",
				"inbound_nodes": [
					[
						[
							"dense_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Dense",
				"config": {
					"name": "dense_3",
					"trainable": true,
					"units": 10,
					"activation": "softmax",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "uniform",
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					}
				},
				"name": "dense_3",
				"inbound_nodes": [
					[
						[
							"dropout_2",
							0,
							0,
							{}
						]
					]
				]
			}
		],
		"input_layers": [
			[
				"input_1",
				0,
				0
			]
		],
		"output_layers": [
			[
				"dense_3",
				0,
				0
			]
		]
	},
	"keras_version": "2.0.6",
	"backend": "tensorflow",
	"optimizer": "Adam",
	"metrics": [
		"accuracy"
	],
	"fit.callback": [
		"TendorBoard"
	],
	"loss": "categorical_crossentropy",
	"fit.epochs": 20,
	"fit.batch_size": 128
}